{
    "last_update": "1/02/2024",
    "Summary": {
        "description": "Hardworking, quick learner, and highly motivated to succeed in every endeavor.",
        "chinesedescription": "有责任心，快速学习能力强，有很高的自信心，能够在任何一个项目中取得成功",
        "aboutme":"some content about me",
        "chineseaboutme":"关于我",
        "introduction": "Greetings! I'm Dr. Hackman, a computer science enthusiast with an insatiable curiosity for data science. I obtained my Ph.D. degree from National Chiao Tung University, where I also completed a one-year postdoc fellowship. For both my Ph.D. and fellowship, I was supervised by Prof. Vincent S. Tseng. Prior to this, I earned my master's in computer science from Yuan Ze University and my bachelor's in computer science from The University of The Gambia. My Ph.D. dissertation is titled A Study on Trend Analysis in High Utility Itemset Mining. My research interests include data mining, machine learning, medical AI, deep learning, generative AI, and data analytics. Currently, my research is focused on the medical field, aligning with my current job position. In this role, I aim to develop medical AI models that can make a positive impact on the healthcare sector.",
        "fname": "Acquah",
        "lname": "Hackman",
        "chinesename": "哈克曼博士",
        "frenchname": "Aqua",
        "phone": "(+886) 988-161-854",
        "email": "actechforlife@gmail.com",
        "birthday": "May, 8",
        "city": "Changhua City",
        "webpage": "actechforlife.github.io",
        "age": "37",
        "degree": "PhD",
        "job": "Data Scientist / Software Engineer",
        "languages": [
            {
                "name": "English",
                "level": "**"
            },
            {
                "name": "Chinese",
                "level": "***"
            }
        ]
    },
    "Education": {
        "doctorate": {
            "university": "National Chiao Tung University",
            "department": "Electrical Engineering and Computer Science",
            "address": "Hsinchu, TW",
            "title": "Doctorate in Electrical and Computer Science",
            "degree": "Ph.D.",
            "from": "2015",
            "to": "2021",
            "dissertation": "A Study of Trend Analysis in High Utility Itemset Mining",
            "advisor": {
                "name": "Vincent S. Tseng",
                "department": "Computer Science"
            }
        },
        "masters": {
            "university": "Yuan Ze University",
            "address": "Taoyuan, TW",
            "title": "Masters in Computer Science",
            "degree": "MSc.",
            "from": "2012",
            "to": "2014",
            "thesis": "A Study of Trend Analysis in High Utility Itemset Mining",
            "advisor": {
                "name": "Hsiu-Hsen Yao",
                "department": "Computer Science"
            }
        },
        "bachelors": {
            "university": "The University of The Gambia",
            "address": "Brikama, GM",
            "title": "Bachelor in Computer Science",
            "degree": "BSc.",
            "from": "2007",
            "to": "2010",
            "achievement": "Employed by the university as a graduate assistant."
        }
    },
    "Experience": [
        {
            "position": "Data Scientist",
            "company": "Changhua Christian Hospital",
            "address": "Changhua City, TW",
            "duration": "2022 - Present",
            "summary": "Currently involved in research on medical AI and generative AI.",
            "responsibilities": [
                "Developing deep learning and machine learning models.",
                "Applying computer vision techniques to medical imaging data for patient diagnosis and improving patient care.",
                "Creating data pipelines for model development.",
                "Playing a key role in Machine Learning Operations (MLOps), including model deployment, monitoring, and continuous improvement.",
                "Conducting exploratory data analysis to uncover insights and trends, contributing to academic publications and industry conferences.",
                "Attending meetings and providing constructive suggestions to colleagues.",
                "Supervise all active projects."
            ]
        },
        {
            "position": "Postdoctoral Researcher",
            "company": "National Yang Ming Chiao Tung University",
            "address": "Hsinchu, TW",
            "duration": "2021 - 2022",
            "summary": "Conducted research on Medical AI and Utility Pattern Mining.",
            "responsibilities": [
                "Conducted academic research.",
                "Assisted my supervisor in publication efforts.",
                "Ensured the smooth flow of lab operations."
            ]
        },
        {
            "position": "Computer Science Lecturer",
            "company": "The University of The Gambia",
            "address": "Brimaka, GM",
            "duration": "2014 - 2015",
            "summary": "Prepared and delivered computer science lectures.",
            "responsibilities": [
                "Prepared and delivered computer science lectures.",
                "Analyzed and recorded student performance.",
                "Provided guidance to students on academic research."
            ]
        },
        {
            "position": "Graduate Assistant",
            "company": "The University of The Gambia",
            "address": "Brimaka, GM",
            "duration": "2010 - 2012",
            "summary": "Assisted lecturers and taught Level 100 computer science courses.",
            "responsibilities": [
                "Aided lecturers in effectively conducting their classes.",
                "Developed a web application for generating student transcripts."
            ]
        }
    ],
    "Skills": {
        "Programming": [
            {
                "name": "Python",
                "competence_level": "90"
            },
            {
                "name": "Java",
                "competence_level": "85"
            },
            {
                "name": "SQL Database Management (Postgres, MSSQL)",
                "competence_level": "75"
            },
            {
                "name": "HTML and CSS",
                "competence_level": "98"
            },
            {
                "name": "PHP",
                "competence_level": "80"
            },
            {
                "name": "JavaScript",
                "competence_level": "70"
            }
        ],
        "Tech_and_Tools": {
            "title": "Tech and Tools",
            "tech": {
                "title": "Machine learning and deep learning frameworks",
                "items": [
                    "Proficient in <b>Scikit-learn</b> for its versatility in machine learning tasks.",
                    "Extensive experience with <b>Tensorflow</b>, leveraging its robust ecosystem for deep learning projects.",
                    "Familiarity with <b>PyTorch</b>, having applied its flexibility and dynamic computational graphs in a few projects for machine learning applications."
                ]
            },
            "tools": {
                "title": "MLOps/DevOps",
                "items": [
                    "Proficient in <b>Docker</b> for efficient containerization, streamlining deployment workflows.",
                    "Experience with <b>Git</b> for version control, ensuring collaborative and organized development processes.",
                    "Working understanding of <b>Kubernetes</b>, utilizing its orchestration capabilities for scalable and resilient deployments.",
                    "Familiarity with <b>Jenkins</b> for implementing robust and automated <b>CI/CD</b> pipelines.",
                    "Experienced and excellent understanding of <b>Django</b> for web application development.",
                    "Developed backend services using <b>Flask</b>, harnessing simplicity and flexibility for robust applications.",
                    "Utilized <b>FastAPI</b> to create high-performance APIs, leveraging modern Python features for seamless integration."
                ]
            }
        }
    },
    "Projects": [
        {
            "title": "Automatic Segmentation of Membranous Glottal Gap Area with U-Net-based Architecture",
            "type": "Industry",
            "description": "Videostroboscopy is a widely used method for investigating vocal fold function. However, evaluating numerical values, such as the membranous glottal gap area, is time-consuming for clinical application. We enrolled 137 patients and collected 2507 videostroboscopy images. We developed five U-Net-based deep-learning models for automatically masking the membranous glottal gap area.",
            "funding": {
                "by": "Changhua Christian Hospital",
                "amount": "Not available"
            },
            "institution": "Changhua Christian Hospital",
            "duration": {
                "start": "2022",
                "end": "ongoing"
            },
            "technologies": [
                "Python",
                "TensorFlow",
                "Python-Flask",
                "OpenCV",
                "FastAPI"
            ],
            "role": "Full Stack Engineer, MLOps",
            "contribution": [
                "Developed a user-friendly interface for medical AI applications.",
                "Performed the ETL for the project.",
                "Trained all deep learning models for the project.",
                "Implemented FastAPI for integration into the hospital's health information system.",
                "Drafted and wrote over 50% of the research manuscript."
            ],
            "outcome": "The best model's I0U score is 0.8503. We integrated the model into the hospital to improve patient care. Our manuscript was accepted for publication.",
            "challenges": "One of the main challenges is that the segmentation output has a condition we referred to as broken edges in some cases. To address this problem, we developed an edge-filling algorithm."
        },
        {
            "title": "Funduscopic Image Analysis",
            "type": "Industry",
            "description": "The Funduscopic Image Analysis project aims to conduct a comprehensive examination of funduscopic images, establishing a robust correlation between the status of the fundus and various systemic diseases. Funduscopic images provide valuable insights into the eye's interior, particularly the retina and optic nerve, serving as a non-invasive diagnostic tool for systemic health assessment. Leveraging advanced medical AI techniques, the project extracts meaningful patterns and relationships from funduscopic images, contributing to early disease detection and personalized patient care.",
            "funding": {
                "by": "Changhua Christian Hospital",
                "amount": "$600,000"
            },
            "institution": "Changhua Christian Hospital",
            "duration": {
                "start": "2023",
                "end": "ongoing"
            },
            "technologies": [
                "Python",
                "TensorFlow",
                "Python-Flask"
            ],
            "role": "Full Stack Engineer, MLOps",
            "contribution": [
                "Developed a user-friendly interface for medical AI applications.",
                "Designed the strategy for model training.",
                "Implemented deep learning methods for funduscopic image analysis.",
                "Drafted and wrote over 70% of the research manuscript."
            ],
            "outcome": "Currently, we have achieved a model accuracy of 91%, and our manuscript is nearing completion for submission.",
            "challenges": "As the sole technical member on the team, overcoming challenges included learning and adapting to new technologies and tools."
        },
        {
            "title": "Large Language Model for ICD Coding",
            "type": "Industry",
            "description": "Automation of ICD (International Classification of Diseases) code prediction from medical records. This project aims to fine-tune open-source large language models for predicting ICD codes from medical records. The current manual process of assigning ICD codes to diseases is error-prone and subject to human interpretation.",
            "funding": {
                "by": "Funded by Changhua Christian Hospital",
                "amount": ""
            },
            "institution": "Changhua Christian Hospital",
            "duration": {
                "start": "2023",
                "end": "ongoing"
            },
            "technologies": [
                "Python",
                "Llama-2",
                "Falcon",
                "Python-Flask",
                "FastAPI",
                "PostgreSQL"
            ],
            "role": "Data Scientist, MLOps Engineer",
            "contribution": [
                "Data cleaning and preprocessing.",
                "Developed strategies for fine-tuning the models.",
                "User interface development for ICD coding.",
                "Drafted and wrote over 98% of the research manuscript."
            ],
            "outcome": "The project has produced an open-source ICD coder, poised to significantly reduce coding time, with my ongoing commitment to optimize its use.",
            "challenges": "Managing the dataset presented a significant challenge, necessitating innovative strategies for information extraction and model-friendly representation."
        },
        {
            "title": "Skin Lesion Detection and Classification",
            "type": "Industry",
            "description": "Utilizing over three thousand images from the EHR system of Changhua Christian Hospital, our goal is to develop a model for detecting skin lesions and classifying them into distinct categories.",
            "funding": {
                "by": "No Funding",
                "amount": ""
            },
            "institution": "Changhua Christian Hospital",
            "duration": {
                "start": "2023",
                "end": "ongoing"
            },
            "technologies": [
                "Python",
                "TensorFlow",
                "Python-Flask",
                "OpenCV"
            ],
            "role": "Data Scientist",
            "contribution": [
                "Prepared the dataset for training.",
                "Conducted model training for classification.",
                "Developed the user interface for the model."
            ],
            "outcome": "Our initial accuracy on the binary classification task reached 92%, and we are actively working on enhancing the model's performance while expanding the number of classes.",
            "challenges": "Several artifacts in the dataset require removal. Our initial approach involved using cropping to mitigate artifacts, and we aim to explore alternative approaches in future iterations."
        },
        {
            "title": "Detection of LVI from WSI using Deep Learning Methods",
            "type": "Industry",
            "description": "The application of deep learning in pathology for identifying Lymphovascular Invasion (LVI) is well-studied. However, at our hospital, we are developing a deep learning model to identify LVI and implementing a report generator to alleviate the workload of pathologists.",
            "funding": {
                "by": "No Funding",
                "amount": ""
            },
            "institution": "Changhua Christian Hospital",
            "duration": {
                "start": "2023",
                "end": "ongoing"
            },
            "technologies": [
                "Python",
                "TensorFlow",
                "Python-Flask",
                "OpenCV",
                "FastAPI"
            ],
            "role": "Data Scientist",
            "contribution": [
                "Data cleaning and preprocessing.",
                "Model building and training.",
                "User interface development for LVI detection."
            ],
            "outcome": "Our developed platform can identify the presence of LVI in WSI images with 95% accuracy. Currently, we are integrating the model inference into a report generation framework.",
            "challenges": "The size of each Whole Slide Image is significantly large; therefore, we implemented a slicing strategy to process each image."
        },
        {
            "title": "No-Code Low-Code AutoML Platform for Medical AI Applications",
            "type": "Industry",
            "description": "This project aims to create a user-friendly platform that medical professionals can use without any coding requirements. Domain experts in data science can also leverage this application to build their own models.",
            "funding": {
                "by": "Funded by Changhua Christian Hospital",
                "amount": "awaiting funding"
            },
            "institution": "Changhua Christian Hospital",
            "duration": {
                "start": "2023",
                "end": "ongoing"
            },
            "technologies": [
                "Python",
                "TensorFlow",
                "Django",
                "FastAPI",
                "Docker container",
                "Celery",
                "Redis",
                "PostgreSQL"
            ],
            "role": "Full Stack Engineer, MLOps Engineer",
            "contribution": [
                "Designed the project architecture.",
                "Developed the user management module.",
                "Built the MVP of the Low-code Module.",
                "Implemented the CSV data import module.",
                "Implemented the CSV data cleaning module."
            ],
            "outcome": "The current outcomes include the CSV data cleaning module, and the low-code module is currently under development.",
            "challenges": "The main challenge in this project is the limited manpower availability. We are actively seeking solutions to address this issue once the funding is secured."
        },
        {
            "title": "Denial of Service Attack Detection",
            "type": "Industry",
            "description": "Identifying and mitigating distributed denial-of-service attacks using deep learning methods.",
            "funding": {
                "by": "Collaborated Company",
                "amount": "Not available"
            },
            "institution": "National Chiao Tung University",
            "duration": {
                "start": "2020",
                "end": "2021"
            },
            "technologies": [
                "Python",
                "PyTorch",
                "Java"
            ],
            "role": "Researcher",
            "contribution": [
                "Designed and built a simulator for the project.",
                "Performed ETL for parameter selection."
            ],
            "outcome": "Provided a parameter list for more efficient model development, achieving an accuracy of over 90% in the initial phase.",
            "challenges": "The primary challenge in this project was working with an unfinished hardware device. To address this, we developed a simulator to generate data based on open-source dataset specifications, such as the CIC-IDS2017 dataset, and the specifications of the hardware device."
        },
        {
            "title": "Diagnoses of Multiple Sclerosis Using Deep Learning Methods",
            "type": "Research",
            "description": "Developed a model for classifying multiple sclerosis patients.",
            "funding": {
                "by": "No Funding",
                "amount": "Not available"
            },
            "institution": "National Chiao Tung University",
            "duration": {
                "start": "2021",
                "end": "2022"
            },
            "technologies": [
                "Python",
                "PyTorch",
                "Java",
                "Flask"
            ],
            "role": "Researcher",
            "contribution": [
                "Performed the ETL for the project.",
                "Built different models for comparison."
            ],
            "outcome": "Developed five models for comparison, with our best model achieving over 82% accuracy.",
            "challenges": "While the project had a flexible timeline, being the sole member working on it required me to invest extended hours in the lab to ensure task completion."
        },
        {
            "title": "Survey of Continual Learning Frameworks",
            "type": "Research",
            "description": "Conducted a thorough preliminary study to explore and understand continual learning frameworks in preparation for a collaborative project. Regrettably, despite our efforts, the project was not awarded to my lab. The study aimed to lay the groundwork for potential collaboration, assessing the landscape of continual learning methodologies and their applications in various domains.",
            "funding": {
                "by": "No Funding",
                "amount": "Not available"
            },
            "institution": "National Chiao Tung University",
            "duration": {
                "start": "2021",
                "end": "2022"
            },
            "technologies": [],
            "role": "Researcher",
            "contribution": [
                "Surveyed numerous papers on continual learning.",
                "Tabulated and documented the surveyed materials."
            ],
            "outcome": "Although the collaborative project did not materialize, the extensive survey provided invaluable insights into the diverse landscape of continual learning frameworks and their potential applications across various disciplines. This experience enhanced my knowledge and understanding of the evolving field.",
            "challenges": "The primary challenge encountered during this project was the vast amount of materials to survey. Navigating through numerous papers and synthesizing relevant information demanded meticulous attention to detail and a comprehensive understanding of the subject matter."
        },
        {
            "title": "Trend Analysis in Utility Pattern Mining",
            "type": "Research",
            "description": "Expand and significantly contribute to the utility pattern mining research.",
            "funding": {
                "by": "Supported by Ministry of Science and Technology",
                "amount": "Not available"
            },
            "institution": "National Chiao Tung University",
            "duration": {
                "start": "2018",
                "end": "2021"
            },
            "technologies": [
                "Python",
                "Java",
                "SQL"
            ],
            "role": "Ph.D Student",
            "contribution": [
                "Surveyed and tabulated many utility pattern mining publications",
                "proposed and designed mining algorithms.",
                "Implemented mining algorithm in both java and python programming languages.",
                "Drafted and published academic papers in international conferences."
            ],
            "outcome": "We proposed applications of utility pattern mining by introducing the following itemsets; Trending High Utility Itemsets. Emerging High Utility Itemsets. Stable High Utility Itemsets. We published three academic papers in international conferences.",
            "challenges": "Published research work in the area of high utility itemset mining has very excellent algorithms that are already archiving excellent results. To manage this challenge and make better contribution, we proposed applications for variations of the HUIM problem."
        }
    ],
    "Publications": [
        {
            "title": "Automatic Segmentation of Membranous Glottal Gap Area with U-Net-based Architecture",
            "authors": "<b>Acquah Hackman</b>, Chih-Hua Chen, Andy Wei-Ge Chen, Mu-Kuan Chen",
            "type": "Journal",
            "publisher_name": "The Laryngoscope",
            "year": "2023",
            "role": "first author"
        },
        {
            "title": "Stable High Utility Itemset Mining",
            "authors": "<b>Acquah Hackman</b>, Yu Huang, Philippe Fournier-Viger, Vincent Tseng",
            "type": "Conference",
            "publisher_name": "iiWAS 2021",
            "year": "2021",
            "role": "first author"
        },
        {
            "title": "Mining emerging high utility itemsets over streaming database",
            "authors": "<b>Acquah Hackman</b>, Yu Huang, Philip S Yu, Vincent S Tseng",
            "type": "Conference",
            "publisher_name": "ADMA 2019",
            "year": "2019",
            "role": "first author"
        },
        {
            "title": "Accessing and constructing driving data to develop fuel consumption forecast model",
            "authors": "Rei-Jo Yamashita, Hsiu-Hsen Yao, Shih-Wei Hung, <b>Acquah Hackman</b>",
            "type": "Conference",
            "publisher_name": "IOP Conference Series: Earth and Environmental Science",
            "year": "2018",
            "role": "fourth author"
        },
        {
            "title": "Mining trending high utility itemsets from temporal transaction databases",
            "authors": "<b>Acquah Hackman</b>, Yu Huang, Vincent S Tseng",
            "type": "Conference",
            "publisher_name": "DEXA 2018",
            "year": "2018",
            "role": "first author"
        },
        {
            "title": "Generating a road situation data warehouse using detectives car approach",
            "authors": "Cheng-Da Huang, <b>Acquah Hackman</b>, Hsiu-Hsen Yao, Syuan-Yi Chen",
            "type": "Conference",
            "publisher_name": "ICITCS 2013",
            "year": "2013",
            "role": "second author"
        }
    ],
    "Awards": [
        {
            "title": "Runner-up for Best Student Paper Award",
            "issued_by": "15th International Conference on Advanced Data Mining and Application",
            "year": "2019"
        },
        {
            "title": "Award of Outstanding Students",
            "type": "National Chiao Tung University",
            "year": "2015"
        },
        {
            "title": "Award of Outstanding Students",
            "type": "National Chiao Tung University",
            "year": "2016"
        },
        {
            "title": "Award of Outstanding Students",
            "type": "National Chiao Tung University",
            "year": "2017"
        },
        {
            "title": "Award of Outstanding Students",
            "type": "National Chiao Tung University",
            "year": "2018"
        }
    ],
    "Referees": [
        {
            "name": "Vincent S. Tseng",
            "affiliation": "National Yang Ming Chiao Tung University",
            "contact": {
                "email": "vtseng@cs.nctu.edu.tw",
                "phone": "",
                "webpage": "https://people.cs.nycu.edu.tw/~vtseng/"
            },
            "comment": "I know Acquah Hackman as a very hardworking individual.",
            "img_url": "https://www.cs.nycu.edu.tw/storage/avatars/ri0xkl6d2wejztTix5InFWLWgotNxdj9QDaKd6Iu.png",
            "type": "Professional"
        },
        {
            "name": "Yu Huang",
            "affiliation": "University of Florida",
            "contact": {
                "email": "huanyu@ufl.edu",
                "phone": "7187552887",
                "webpage": "https://yuvisu.github.io/"
            },
            "comment": "Acquah is a well-trained computer scientist with a strong background in AI and data mining. His ability to rapidly acquire and apply new techniques and knowledge is truly noteworthy. Moreover, his affable nature makes him a pleasure to interact with, fostering effective communication and collaboration among peers and colleagues.",
            "img_url": "https://yuvisu.github.io/assets/img/prof_pic.jpg",
            "type": "Professional"
        },
        {
            "name": "Andy Wei-Ge Chen",
            "affiliation": "Department of Otorhinolaryngology, Changhua Christian Hospital",
            "contact": {
                "email": "169277@cch.org.tw",
                "phone": "",
                "webpage": "https://scholar.google.com.tw/citations?user=n7YI3rkAAAAJ&hl=zh-TW"
            },
            "comment": "",
            "img_url": "https://scholar.googleusercontent.com/citations?view_op=view_photo&user=n7YI3rkAAAAJ&citpid=2",
            "type": "Professional"
        }
    ],
    "invited_talks":[
        {
            "event": "2024 AI on Clinical Decision Making and Precision Medicine Forum",
            "title": "Medical AI: Application and Forecast",
            "venue": "Forte Hotel Changhua",
            "date": "2024-03-21",
            "time": "09:00 - 12:00",
            "abstract": "",
            "role":"Keynote 1"
        },
        {
            "event": "Healthcare Expo - Taiwan",
            "title": "Applications of Large Language Models at Changhua Christian Hospital",
            "venue": "Nangang International Exhibition Center, Hall1",
            "date": "2023-12-03",
            "time": "09:00 - 12:00",
            "abstract": "",
            "role":"Public Speech"
        },
        {
            "event": "Weekly General Hospital Seminar",
            "title": "AI-based Retinal Image Analysis for systemic disease prediction",
            "venue": "Changhua Christian Hospital",
            "date": "2023-04-07",
            "time": "07:45 - 08:00",
            "abstract": "",
            "role":"Speech"
        },
        {
            "event": "Departmental Archievement Report",
            "title": "Privacy Assurance in Medical Large Language Models",
            "venue": "Nangang International Exhibition Center, Hall1",
            "date": "2023-07-12",
            "time": "09:00 - 12:00",
            "abstract": "",
            "role":"Lecture"
        }
    ]
}